require "public"

function init_ios_i5()
	
	local t = {}
	
	t["答题界面"] = "0|0|0xffcf18,-10|1|0xffcf18,-27|7|0xffcf18,-4|5|0xffcf18,4|-13|0xffcf18,177|-12|0xffcf18,176|2|0xffcf18,174|13|0xffcf18,191|13|0xffcf18,203|10|0xffcf18,206|-5|0xffcf18,177|-5|0xffcf18,173|16|0xffcf18,2|21|0x926100,-20|17|0xffcf18"
	
	t["选项出现"] = "0|0|0xfff8e3,-2|50|0xfff8e3,385|51|0xfff8e3,388|2|0xfff8e3,356|49|0xfff8e3,302|53|0xfff8e3,174|51|0xfff8e3,-13|87|0xfff8e3,379|87|0xfff8e3,374|132|0xfff8e3,79|136|0xfff8e3,4|134|0xfff8e3,-13|134|0xfff8e3,0|67|0x1d78aa,-4|150|0x1c74a6,138|-88|0x2079ac,138|-88|0x2079ac,356|-2|0xfff8e3"
	
	t["选项出现2"] = "0|0|0xaac2d8,375|0|0xaac2d8,363|46|0xaac2d8,319|46|0xaac2d8,210|47|0xaac2d8,12|43|0xaac2d8,-11|83|0xaac2d8,374|84|0xaac2d8,375|126|0xaac2d8,318|133|0xaac2d8,152|128|0xaac2d8,18|129|0xaac2d8,2|63|0x1e7bad,142|-92|0x217bae,16|130|0xaac2d8"
	
	t["OCR边界"] =
	{
		["yOffset"] = 314, --开始切图的y
		["y1"] = 314 - 314, -- 题目上方y
		["y2"] = 688 - 314, -- 选项上方
		["x1"] = 103, -- 选项左
		["x2"] = 534, -- 选项右
		["y3"] = 551 -  314,  -- 得分上方y
		["y4"] = 1014 - 314   --选项下方y
	}
	
	t["选项坐标"] = 
	{
		{100,722},
		{100,811},
		{100,895},
		{100,979}
	}
	
	t["探测正确答案坐标"] = 
	{
		{{317,698,0x44f28a}},
		{{317,698,0x44f28a}},
		{{318,869,0x44f28a}},
		{{319,953,0x44f28a}}
	}
	
	t["探测正确答案坐标2"] = 
	{
		{{317,698,0x56bfb0}},
		{{317,698,0x56bfb0}},
		{{318,869,0x56bfb0}},
		{{319,953,0x56bfb0}}
	}
	
	
	t["正确答案颜色"] = "0|0|0x44f28a,4|-24|0x44f28a,0|27|0x44f28a,39|29|0x44f28a,103|30|0x44f28a,170|28|0x44f28a,292|29|0x44f28a,359|27|0x44f28a,353|-25|0x44f28a,232|-23|0x44f28a,173|-23|0x44f28a"
	
	t["正确答案颜色2"] = "0|0|0x56bfb0,74|29|0x56bfb0,165|31|0x56bfb0,315|33|0x56bfb0,336|3|0x56bfb0,336|-18|0x56bfb0,235|-22|0x56bfb0,156|-19|0x56bfb0,125|-22|0x56bfb0,82|-18|0x56bfb0,56|-18|0x56bfb0"
	
	t["提示字体和高度"] =  
	{
		["txtSize"] = 28,
		["bgHight"] = 70,
		["txtBgOffset"] = 60
	}
	
	return t
end