require "public"

function init_ios_i6()
	
	local t = {}
	
	t["答题界面"] = "0|0|0xffcf18,-1|9|0xffcf18,4|16|0xffcf18,27|16|0xffcf18,36|-4|0xffcf18,32|-19|0xffcf18,17|16|0xffcf18,-4|31|0xffcf18,36|25|0x926100,53|25|0x926100,62|22|0xffbb12,261|11|0xffcf18,270|20|0xffcf18,249|29|0x926100,278|28|0xffcf18,291|26|0xffcf18,291|9|0xffcf18,291|-1|0xffcf18,268|-14|0xffcf18,258|-17|0xffcf18"
	
	t["选项出现"] = "0|0|0xfff8e3,-11|63|0xfff8e3,467|64|0xfff8e3,468|4|0xfff8e3,5|85|0x1e7daf,-10|166|0xfff8e3,-9|101|0xfff8e3,466|102|0xfff8e3,467|161|0xfff8e3,12|182|0x1c78aa,175|-102|0x1e74a7"
	
	t["选项出现2"] ="0|0|0xaac2d8,453|5|0xaac2d8,454|55|0xaac2d8,-7|54|0xaac2d8,-8|101|0xaac2d8,-9|158|0xaac2d8,455|98|0xaac2d8,459|157|0xaac2d8,174|-106|0x1f76a9,37|162|0xaac2d8"
	
	t["OCR边界"] =
	{
		["yOffset"] = 377, --开始切图的y
		["y1"] = 377 - 377, -- 题目上方y
		["y2"] = 809 - 377, -- 选项上方
		["x1"] = 118, -- 选项左
		["x2"] = 631, -- 选项右
		["y3"] = 653 -  377,  -- 得分上方y
		["y4"] = 1201 - 377   --选项下方y
	}
	
	t["选项坐标"] = 
	{
		{162,847},
		{161,949},
		{158,1047},
		{160,1147}
	}
	
	t["探测正确答案坐标"] = 
	{
		{{377,817,0x44f28a}},
		{{371,915,0x44f28a}},
		{{373,1015,0x44f28a}},
		{{368,1116,0x44f28a}}
	}
	
	t["探测正确答案坐标2"] = 
	{
		{{377,817,0x56bfb0}},
		{{371,915,0x56bfb0}},
		{{373,1015,0x56bfb0}},
		{{368,1116,0x56bfb0}}
	}
	
	t["正确答案颜色"] = "0|0|0x44f28a,20|-48|0x44f28a,71|1|0x44f28a,184|3|0x44f28a,132|0|0x44f28a,254|0|0x44f28a,346|2|0x44f28a,358|-53|0x44f28a,257|-56|0x44f28a,173|-57|0x44f28a,89|-54|0x44f28a"
	
	t["正确答案颜色2"] = "0|0|0x56bfb0,-9|58|0x56bfb0,176|64|0x56bfb0,207|61|0x56bfb0,242|61|0x56bfb0,367|62|0x56bfb0,418|-5|0x56bfb0,335|-1|0x56bfb0,287|-2|0x56bfb0"
	
	t["提示字体和高度"] =  
	{
		["txtSize"] = 28,
		["bgHight"] = 70,
		["txtBgOffset"] = 60
	}
	
	return t
end